# read input file to internal representation
read_verilog -sv ../Decoder7Seg.v
hierarchy -top Decoder7Seg

# Convert high-level behavioral parts ("processes") to d-type flip-flops and muxes
proc 

# Perform some simple optimizations
opt 

# Convert design to (logical) gate-level netlists
techmap 

# Perform some simple optimizations
opt

write_verilog Decoder7Seg_synth.v
