# read input file to internal representation
read_verilog -sv ../CounterClockSource.v
hierarchy -top CounterClockSource

# Convert high-level behavioral parts ("processes") to d-type flip-flops and muxes
proc 

# Perform some simple optimizations
opt 

# Convert design to (logical) gate-level netlists
techmap 

# Perform some simple optimizations
opt

write_verilog CounterClockSource_synth.v
