# read input file to internal representation
read_verilog -sv ../RippleCarryAdder.v
hierarchy -top RippleCarryAdder4Bit

# Convert high-level behavioral parts ("processes") to d-type flip-flops and muxes
proc 

# Perform some simple optimizations
opt 

# Convert design to (logical) gate-level netlists
techmap

# Perform some simple optimizations
opt

write_verilog RippleCarryAdder_synth.v
